////算数操作符
////+ - * / 
////% 取模，得到余数 
////
////移位操作符
////>> 二进制下向右移位，每移动1位，相当于除以2 
////<< 二进制下向左移位，每移动1位，相当于乘以2 
////
////位操作
////& 按位与 
////| 按位或 
////^按位异或 
////a=3=011 
////b=5=101
////c=a&b=001 (按位合并，同位只要有0合为0，同位都是1合为1)
////d=a|b=111 (按位合并，同位只要有1合为1，同位都是0合为0)
////e=a^b=110 (按位合并，同位相同合为0，同位相异合为1)
////
////
////赋值操作符跟复合赋值操作符 
////=赋值
////==判断相等 
////+= 加上一个数再赋值给自己（a=a+10可以写成a+=10） 
////-= 减去一个数再赋值给自己 
////*= /= 乘上一个数再赋值给自己 
////&= ^= |= 位操作后再赋值给自己 
////>>= <<=  移位操作后再赋值给自己 
////
////单目操作符：  
////双目操作符：操作的是2个量，例如a+b，+操作的是a和b，属于双目操作符 
////三目操作符 
////
////! 逻辑反操作a=10, b=!a
////- 取负操作a=-2（没有取正操作符，+一般省略） 
////& 取地址操作
////sizeof 计算变量或者类型占的空间大小，单位是字节，sizeof (a) 可以写成sizeof a, 但sizeof (int)的括号不能省略
////~对一个数的二进制位取反
////--  ==
//
//
//#include <stdio.h>
//
//int main()
//{
//	int a = 1;    //二进制下为4个字节，32比特位，00000000000000000000000000000001 
//	int b = a << 1; //在二进制下将a的1往左移动1位，变成00000000000000000000000000000010，结果b为2 
//	int c = a << 2; //c=4a
//	printf("%d\n", b);
//	printf("%d\n", c);
//	return 0;
//}
//
//
//
//
////字面常量，比如3，10，3.14 
////const修饰的常变量，const int num=4，const表示num不能再改变，只能是4，num依然是变量，只是拥有常属性 
////#define定义的标识符常量，#define MAX=10 
////枚举常量enum，值不能改，只能0，1，2，...一一列举 ，比如性别（男、女、保密），三原色（红、黄、蓝），星期 ......
//
//enum Sex
//{
//	Male,   //=0
//	Female, //=1
//	Secret  //=2
//};
//int main()
//{
//	// 10, 3.14
//	//const int num=4
//	//#defile MAX=10
//	//enum Sex s=Female;
//	printf("%d\n", Male);
//	printf("%d\n", Female);
//	printf("%d\n", Secret);
//	return 0;
//}
//
//
//
//
//
//int Add(int x, int y)   //自定义的一个函数，跟库函数区分开来 
//{
//	int z = x + y;
//	return z;
//}
//int main()
//{
//	int num1 = 10;
//	int num2 = 20;
//	int a = 100;
//	int b = 200;
//	int sum = 0;
//	sum = Add(num1, num2);
//	sum = Add(a, b);
//	printf("sum=%d\n", sum);
//	return 0;
//}
//
//
//
//
//
////int arr[10] 定义一个存放10个整型数字的数组 
////char ch[20] 定义一个存放20个字符的数组 
////float arr[5]
//
//#include <stdio.h>
//
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d\n", arr[i]);
//		i++;
//	}
//	return 0;
//}
//
//
//
//
//
//
//#include <stdio.h>   //因为使用的库函数 
//#include <string.h> //因为后面引用了strlen函数 
//
////int main() //选择语句 
////{
////	int input=0;
////	printf("加入比特\n");
////	printf("你要好好学习吗？(1/0)>:");
////	scanf("%d", &input);
////	if(input==1)
////	printf("好offer\n");
////	else
////	printf("卖红薯\n");
////	return 0;
//// } 
//
//
//int main()  //循环语句 
//{
//	int line = 0;
//	printf("加入比特\n");
//	while (line < 20000)
//	{
//		printf("敲一行代码:%d\n", line);
//		line++;
//	}
//	if (line >= 20000)
//		printf("好offer\n");
//	return 0;
//}
//
//
//
//
////注释的应用
///* 中间的内容直接忽略掉 但是不能多层嵌套使用 */
//// 可以忽略后面的内容 
////也可以选中需要注释的内容，编辑-注释，快捷键ctrl+/，再按一次去掉注释 
//
//
//
//
//
//// 转义字符
//// \n 表示换行 
//// \t 表示水平制表符，等于按Tab键 
//// \v 表示垂直制表符 
//// \? 让问号保持为问号，防止？？）变成】，改成\?\?) 
//// \\ 第一个\表示反斜杠，让第二个\就是一个普通的\，比防止第二个\造成转义 
//// \ddd 表示1-3个八进制数字，如：\130 =X
//// \xdd 表示2个十六进制数字，如：\x30 =0 
//// \32 表示32是个八进制数字，把转为十进制为26，查ASCII表是向右的箭头，所以\32只占1个字符 
//// \后面带x为16进制，直接跟数字是8进制 
//
//#include<stdio.h>
//#include<string.h>
//
//int main()
//{
//	printf("\\test\n"); //第一个\的作用：防止\t转义为tab键 
//	printf("\test\n");  //打印结果为      est 
//	printf("%c\n", 'a');  //单引号引字符，双引号引字符串，%c打印字符，%s打印字符串 
//	printf("%c\n", '\''); //斜杠让第二个'仅仅表示'，不能跟第一个'组队，不让第三个'落单，打印出错 
//	printf("%s\n", "\""); //斜杠效果同上 
//	printf("%d\n", strlen("c:\test\32\test.c")); //输出为13，\t,\32都只占1个字符 
//	printf("%c\n", '\32'); //8进制转10进制，再查表打印为向右的箭头，只占1个字符 
//	printf("%c\n", '\x61'); //16进制数字61转为10进制再查表，结果为a，只占1个字符 
//	printf("%c\n", '\132'); //8进制转10进制，再查表，输出为字母Z，只占1个字符 
//	return 0;
//}





//字符串：双引号内的内容，单引号里放单个字符 
// "abcde", "hello bit", ""空字符串 ，'a', 'b', 'c' 
//ASCII 编码
//ASCII 码值：A=65, a=97...... 

#include <stdio.h>
#include <string.h> //因为后面引用了strlen函数 

int main()
{
	char arr1[] = "abc"; // 把字符串abc放进数组arr1，字符串abc后面有个\0，作为字符串结束标志，不算字符串内容 
	char arr2[] = { 'a', 'b', 'c' }; // 把三个字符a，b，c放入数组arr2 
	printf("%s\n", arr1);
	printf("%s\n", arr2);
	printf("%d\n", strlen(arr1)); //输出数组arr1里的字符串长度 
	printf("%d\n", strlen(arr2)); //输出数组arr2里的字符串长度 
	return 0;
}